cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/bundle'

brew 'vim'
brew 'git'
brew 'zsh'
brew 'tmux'
brew 'ssh-copy-id'
brew 'tree'
brew 'p7zip'
brew 'wget'
brew 'libev'
brew 'mosh'
brew 'fzf'
brew 'fx'
brew 'ag'
brew 'neovim'
brew 'httpie'
brew 'coreutils'

# fix for Sierra tmux copy register regression
brew 'reattach-to-user-namespace'

brew 'python3'
brew 'pyenv'
brew 'pyenv-virtualenv'

brew 'node'
brew 'yarn'

brew 'terraform'
brew 'awscli'

cask 'rectangle'
cask 'transmission'
cask 'vlc'
cask 'iterm2'
cask 'flux'
cask 'appcleaner'
cask 'aws-vpn-client'

