cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'git'
brew 'legit'
brew 'zsh'
brew 'tmux'
brew 'ack'
brew 'ssh-copy-id'
brew 'tree'
brew 'p7zip'
brew 'node'
brew 'python3'
brew 'wget'
brew 'vim'
brew 'macvim', args: ['override-system-vim']
brew 'docker'
brew 'awscli'
brew 'postgresql'
brew 'mongodb'
brew 'apache-spark'
brew 'pgcli'
brew 'sbt'
brew 'scala'
brew 'cassandra'

cask 'atom'
cask 'google-chrome'
cask 'firefox'
cask 'transmission'
cask 'vlc'
cask 'spotify'
cask 'iterm2'
cask 'pycharm'
cask 'datagrip'
cask 'virtualbox'
cask 'calibre'
cask 'flux'
cask 'android-file-transfer'
cask 'anki'
cask 'imageoptim'
cask 'appcleaner'
cask 'xmind'
