cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'vim'
brew 'macvim', args: ['override-system-vim']
brew 'git'
brew 'legit'
brew 'zsh'
brew 'tmux'
brew 'ack'
brew 'ssh-copy-id'
brew 'tree'
brew 'p7zip'
brew 'wget'
brew 'libev'
# fix for Sierra tmux copy register regression
brew 'reattach-to-user-namespace'

# matplotlib dependencies
brew 'freetype'
brew 'ttfautohint', args:  ['with-qt']

# install latest java before scala
cask 'java'
brew 'scala'

brew 'python3'
brew 'pyenv'
brew 'node'
brew 'sbt'

brew 'awscli'
brew 'pgcli'

brew 'postgresql'
brew 'mongodb'
brew 'cassandra'
brew 'apache-spark'

cask 'transmission'
cask 'vlc'
cask 'iterm2'
cask 'flux'
cask 'imageoptim'
cask 'appcleaner'
cask 'aerial'
